import { writable } from "svelte/store";

export const rate = writable(1);
export const pitch = writable(1);
export const audio = writable();

let text1 = `
โควิด 19  
โรคติดต่อทางเดินหายใจ 
ที่ส่งผลให้เกิดโรคปอดอักเสบ 
มีอาการสำคัญคือ ไข้ ไอ หายใจเหนื่อยหอบ 
ไวรัสสามารถแพร่กระจายจากคนสู่คน ได้ผ่านทางการไอ จาม สัมผัส น้ำมูก น้ำลาย
พบการระบาดครั้งแรก ตลาด South China Seafood เมืองอู่ฮั่น มณฑลหูเปย์ ประเทศจีน

จากนั้นแพร่ระบาดไป หลายๆพื้นที่ในประเทศจีนและประเทศอื่นๆ 

คำแนะนำในการปฏิบัติตัว

หลีกเลี่ยงการเดินทาง ปยังพื้นที่ๆมีการระบาดของโรค

สังเกตอาการ หากมีใข้ ไอ หายใจเหนื่อยหอบ ให้ไปพบแพทย์ที่โรงพยาบาลทันที

พร้อมทั้งแจ้งประวัติการเดินทางไปยังพื้นที่ที่มีการระบาดของโรค ภายใน14วัน

หลีกเลี่ยงสถานที่แออัด

ไม่ใช้ของใช้ส่วนตัวร่วมกับผู้อื่น (เช่น ผ้าเช็ด  หน้า   แก้วน้ำ    ผ้าเช็ดตัว)

รักษาร่างกายให้อบอุ่น

นอนหลับพักผ่อนให้เพียงพอ

สวมใส่หน้ากากอนามัย

ไม่สัมผัสหรืออยู่ใกล้ชิดกับสัตว์โดยเฉพาะที่ป่วยหรือตาย

เมื่อไอหรือจามให้ใช้กระดาษทิชชู่หรือแขนเสื้อป้องกันการกระเด็นของน้ำลายและเสมหะ

หมั่นล้างมือด้วยสบู่และให้น้ำไหลผ่านอย่างน้อย 20 วินาที หรือใช้ แอล กอ ฮอล์ เจลล้างมือ

ไม่นำมือมาสัมผัสตา จมูก ปาก โดยไม่จำเป็น
  `;

let text2 = `องค์กรอนามัยโลก (WHO) ได้เปลี่ยนชื่อเรียกไวรัสโควิด
กลายพันธุ์ จากเดิมที่เรียกตามชื่อประเทศเป็นอักษรกรีก
เพื่อลดการกล่าวโทษประเทศทีพบเชื้อโควิดครั้งแรก

อาการที่พบโควิด-19
สายพันธุ์ต่างๆ

สายพันธุ์เดลต้า
(อินเดีย)
ปวดศีรษะ เจ็บคอ มีน้ำมูก
ไม่ค่อยพบการสูญเสีย
การรับรส
มีอาการทั่วไปคล้าย หวัดธรรมดา
*หากรู้สึกไม่สบาย คล้ายเป็นหวัด
ควรสังเกตตัวเอง เมื่อมีอาการ
น่าสงสัยให้รีบไปพบแพทย์

สายพันธุ์อัลฟ่า
(อังกฤษ)มีไข้-น้ำมูก หนาวสั่น  ไอ เจ็บคอ
หายใจถี่หายใจลำบาก ปวดศีรษะ สูญเสียการได้กลิ่น อ่อนเพลีย ปวดเมื่อยตามร่างกาย
อาเจียน หรือท้องเสีย

สายพันธุ์อื่นๆ

ปวดหัว
เจ็บคอ
มีไข้

`;
let text3 = `กลุ่มโรคที่ควรฉีดวัคซีนโควิต
  โรคทางเดินหายใจเรื้อรัง
โรคหัวใจและหลอดเลือด
โรคไตวายเรื้อรัง
โรคหลอดเลือดสมอง
โรคอ้วน
โรคมะเร็ง
โรคเบาหวาน

`;

let text4 = `กลุ่มเสี่ยง
ต้องตรวจคัดกรอง
1.  ไข้ อุณหภูมิ ตั้งแต่
37.5 องศา ขึ้นไป

2.  ไอ มีน้ำมูก เจ็บคอ
จมูกไม่ได้กลิ่น ลิ้นไม่รับรส

3. หายใจเร็ว หายใจเหนื่อย
หรือหายใจลำบาก

4. มีประวัติเคยสัมผัสกับผู้ติดเชื้อ 
หรือผู้ที่เดินทางมาจากพื้นที่เสี่ยงและมีอาการไม่สบาย`;
let text5 = `ปัจจัยเสี่ยง 14 วัน ก่อนเริ่มป่วย
สัมผัสกับผู้ป่วยโควิด
ㆍไปสถานที่รวมกลุ่มคน 
มีผู้ป่วยโควิดเช่น
ตลาดนัด ห้างสรรพสินค้า 
สถานพยาบาล
สถานบันเทิง ขนส่งสาธารณะ
ㆍเดินทางไป-กลับ ในประเทศที่มี
ผู้ป่วยโควิด
ㆍปฏิบัติงานในสถานกักกันโรค
แพทย์สงสัยว่าเป็นโรคโควิด
ㆍ กรณีสัมผัสกับผู้ป่วยโควิด
ไปในสถานที่มีการระบาด

ไม่มีอาการป่วย แต่สงสัยติดโควิด
ㆍ สามารถตรวจคัดกรองโดยไม่เสียค่าใช้จ่าย
โดยมีประวัติเดินทางไปในพื้นที่ที่มีการระบาด มีประวัติเคยสัมผัสกับผู้ติดเชื้อ เคยติดต่อสัมผัสกับผู้ที่เดินทางมาจากพื้นที่เสี่ยงและมีอาการไม่สบาย

`;

let text6 = `
เสี่ยงสูง
คนที่อยู่ใกล้ผู้ป่วย
โดยไม่ใส่แมสก์
ต้องชิดระดับไหน?-คุยกันใกล้ๆ เกิน 5 นาที
อยู่ที่ปิดด้วยกันใน ระยะ 1 เมตร เกิน 15 นาที

ความเสี่ยงต่ำ

คนที่อยู่ใกล้ผู้ป่วย
แต่ใส่แมสก์ป้องกัน
หรือ คนที่อยู่ห่าง
ผู้ป่วยมากกว่า 1 เมตร
ไม่ต้องกักตัว ไม่ต้องตรวจ
แต่สังเกตอาการ 14 วัน

ไม่เสี่ยง คนที่อยู่ไกลมากๆ เช่น คนละชั้น คนละห้อง ข้อแนะนำ ดูแลตัวเอง ใส่แมสก์ ล้างมือบ่อยๆ
`;
let text7 = `
การฉีดวัคซีน
1.ป้องกันการติดโควิด
2.ยับยั้งการแพร่ระบาด
3.เกิดภูมิคุ้มกันหมู่ของชุมชน
4.ลดความรุนแรงหากติดเชื้อ
5.ทุกคนปลอดภัยจากโควิด-19
`;
let text8 = `
อาการข้างเคียง
อาการข้างเคียงไม่รุนแรง ได้แก่ อ่อนเพลีย  ปวดศีรษะ  มีไข้ต่ำๆ ปวดเมื่อยกล้ามเนื้อ และข้อ
อาการข้างเคียงรุนแรง ได้แก่ เวียนศีรษะ มึนงง ใจสั่น มีไข้ไอเจ็บคอ น้ำมูกไหล ปากเบี้ยว กล้ามเนื้ออ่อนแรง และชักหมดสติ
`;
let text9 = `
อาการแพ้วัคซีน
มีไข้สูง   ปวดศีรษะรุนแรง
ความดันตก
ผื่นขึ้นตามตัว
หลอดลมตีบ  หายใจลำบาก
`;

let resultGetVaccins = `อาการข้างเคียง ควรเฝ้าระวังสังเกตอาการหลังฉีดวัคชีนโควิด-19 จนครบ 30 นาที อย่างเคร่งครัด
หากพบว่ามีอาการรุนแรงควรรีบพบแทพย์ทันที
`;
let groupGet = `กลุ่มโรคที่ควรฉีดวัคซีนโควิด-19   
  โรคทางเดินหายใจเรื้อรัง โรคหัวใจและหลอดเลือด 
  โรคไตวายเรื้อรัง โรคหลอดเลือดสมอง โรคอ้วน โรคมะเร็ง โรคเบาหวาน`;

export const textList = [
  text1,
  text2,
  text3,
  text4,
  text5,
  text6,
  text7,
  text8,
  text9,
];
