<script>
  import { browser } from "$app/env";
  import { audio, pitch, rate } from "$lib/audioStore";
  import { fly } from "svelte/transition";
  import { png } from "$lib/assets/index";

  console.log("hello");
  let synt;
  function readOutLoud(message) {
    if (browser) {
      let speech = new SpeechSynthesisUtterance();
      speech.lang = "th-TH";
      speech.text = message;
      speech.volume = 10;
      speech.rate = $rate ? $rate : 1;
      speech.pitch = $pitch ? $pitch : 1;
      synt = window.speechSynthesis;
      synt.speak(speech);
    }
  }
  function stopReadLoud() {
    if (synt != null) {
    }
  }

  let textToRead;

  let text2 = `องค์กรอนามัยโลก (WHO) ได้เปลี่ยนชื่อเรียกไวรัสโควิท
กลายพันธุ์ จากเดิมที่เรียกตามชื่อประเทศเป็นอักษรกรีก
เพื่อลดการกล่าวโทษประเทศทีพบเชื้อโควิทครั้งแรก

อาการที่พบโควิท-19
สายพันธุ์ต่างๆ

สายพันธุ์เดลต้า(อินเดีย)
ปวดศีรษะ เจ็บคอ\\\ มีน้ำมูก
ไม่ค่อยพบการสูญเสีย
การรับรส
มีอาการทั่วไปคล้าย หวัดธรรมดา
*หากรู้สึกไม่สบาย คล้ายเป็นหวัด
ควรสังเกตตัวเอง เมื่อมีอาการน่าสงสัยให้รีบไปพบแพทย์

สายพันธุ์อัลฟ่า
(อังกฤษ)มีไข้-น้ำมูก หนาวสั่น  ไอ เจ็บ คออ หายใจถี่หายใจลำบาก ปวดศีรษะ สูญเสียการได้กลิ่น อ่อนเพลีย ปวดเมื่อยตามร่างกาย
อาเจียน หรือท้องเสีย

สายพันธุ์อื่นๆ

ปวดหัว เจ็บคอ และมีไข้

`;
  let text3 = `กลุ่มโรคที่ควรฉีดวัคซีนโควิต
  โรคทางเดินหายใจเรื้อรัง
โรคหัวใจและหลอดเลือด
โรคไตวายเรื้อรัง
โรคหลอดเลือดสมอง
โรคอ้วน
โรคมะเร็ง
โรคเบาหวาน

`;

  let text4 = `กลุ่มเสี่ยง
ต้องตรวจคัดกรอง
1.  ไข้ อุณหภูมิ ตั้งแต่
37.5 องศา ขึ้นไป

2.  ไอ มีน้ำมูก เจ็บคอ
จมูกไม่ได้กลิ่น ลิ้นไม่รับรส

3. หายใจเร็ว หายใจเหนื่อย
หรือหายใจลำบาก

4. มีประวัติเคยสัมผัสกับผู้ติดเชื้อ 
หรือผู้ที่เดินทางมาจากพื้นที่เสี่ยงและมีอาการไม่สบาย`;
  let text5 = `ปัจจัยเสี่ยง 14 วัน ก่อนเริ่มป่วย
สัมผัสกับผู้ป่วยโควิท
ㆍไปสถานที่รวมกลุ่มคน 
มีผู้ป่วยโควิทเช่น
ตลาดนัด ห้างสรรพสินค้า 
สถานพยาบาล
สถานบันเทิง ขนส่งสาธารณะ
ㆍเดินทางไป-กลับ ในประเทศที่มี
ผู้ป่วยโควิท
ㆍปฏิบัติงานในสถานกักกันโรค
แพทย์สงสัยว่าเป็นโรคโควิท
ㆍ กรณีสัมผัสกับผู้ป่วยโควิท
ไปในสถานที่มีการระบาด

ไม่มีอาการป่วย แต่สงสัยติดโควิท
ㆍ สามารถตรวจคัดกรองโดยไม่เสียค่าใช้จ่าย
โดยมีประวัติเดินทางไปในพื้นที่ที่มีการระบาด 
หรือมีประวัติเคยสัมผัสกับผู้ติดเชื้อ 
เคยติดต่อสัมผัสกับผู้ที่เดินทางมาจากพื้นที่เสี่ยง และ มีอาการไม่สบาย

`;

  let text6 = `
บุคคลที่มีความเสี่ยงสูง แยกเป็น 3 ประเภทดังนี้

บุคคลที่มีความเสี่ยงสูง

ได้แก่คนที่อยู่บุคคลที่อยู่ใกล้ชิดผู้ป่วย โดยไม่ใส่แมสก์
และมีการคุย เกิน 5 นาที
หรืออยู่ที่ปิดด้วยกันใน ระยะ 1 เมตร เกิน 15 นาที


บุคคลที่มี ความเสี่ยงต่ำ

คนที่อยู่ใกล้ผู้ป่วย
แต่ใส่แมสก์ป้องกัน
หรือ คนที่อยู่ห่าง
ผู้ป่วยมากกว่า 1 เมตร
ข้อแนะนำสำหรับบุคคลที่มีความเสี่ยงต่ำ
ไม่ต้องกักตัว ไม่ต้องตรวจ แต่สังเกตอาการ 14 วัน

บุคคลที่ไม่เสี่ยง เช่นบุคคลที่อยู่ไกลมากๆ 
คนละชั้น คนละห้อง 
ข้อแนะนำสำหรับบุคคลที่ไม่เสี่ยงคือ
ดูแลตัวเอง ใส่แมสก์ ล้างมือบ่อยๆ
`;
  let text7 = `
การฉีดวัคซีน
1.ป้องกันการติดโควิท
2.ยับยั้งการแพร่ระบาด
3.เกิดภูมิคุ้มกันหมู่ของชุมชน
4.ลดความรุนแรงหากติดเชื้อ
5.ทุกคนปลอดภัยจากโควิท 19
`;
  let text8 = `
อาการข้างเคียง
อาการข้างเคียงไม่รุนแรง ได้แก่ อ่อนเพลีย  ปวดศีรษะ  มีไข้ต่ำๆ ปวดเมื่อยกล้ามเนื้อ และข้อ
อาการข้างเคียงรุนแรง ได้แก่ เวียนศีรษะ มึนงง ใจสั่น มีไข้ไอเจ็บคอ น้ำมูกไหล ปากเบี้ยว กล้ามเนื้ออ่อนแรง และชักหมดสติ
`;
  let text9 = `
อาการแพ้วัคซีน
มีไข้สูง   ปวดศีรษะรุนแรง
ความดันตก
ผื่นขึ้นตามตัว
หลอดลมตีบ  หายใจลำบาก
`;

  let text = `โรคโควิท 19 คือ โรค ติดต่อ ซึ่งเกิดจากไวรัสโคโรนาชนิดที่มีการ ค้นพบล่าสุด ไวรัสและโรคอุบ ัติใหม่น ี้ไม่เป็นที่รู้จักเลยก่อ นที่จะมีการระบาดใน เมืองอู่ฮ ั่น ประเทศจีนในเดือนธันวาคมปี2019. ขณะนี้โรคโควิท19 มีการระบาดใหญ่ไปทั่ว`;
  let resultGetVaccins = `อาการข้างเคียง ควรเฝ้าระวังสังเกตอาการหลังฉีดวัคชีนโควิท 19 จนครบ 30 นาที อย่างเคร่งครัด
หากพบว่ามีอาการรุนแรงควรรีบพบแทพย์ทันที
`;
  let groupGet = `กลุ่มโรคที่ควรฉีดวัคซีนโควิท 19   
  โรคทางเดินหายใจเรื้อรัง โรคหัวใจและหลอดเลือด 
  โรคไตวายเรื้อรัง โรคหลอดเลือดสมอง โรคอ้วน โรคมะเร็ง โรคเบาหวาน`;

  let text1 = `
โควิท 19  
โรคติดต่อทางเดินหายใจ 
ที่ส่งผลให้เกิดโรคปอดอักเสบ 
มีอาการสำคัญคือ ไข้ ไอ หายใจเหนื่อยหอบ 
ไวรัสสามารถแพร่กระจายจากคนสู่คน ได้ผ่านทางการไอ จาม สัมผัส น้ำมูก น้ำลาย
พบการระบาดครั้งแรก ตลาด South China Seafood เมืองอู่ฮั่น มณฑลหูเปย์ ประเทศจีน

จากนั้นแพร่ระบาดไป หลายๆพื้นที่ในประเทศจีนและประเทศอื่นๆ 

คำแนะนำในการปฏิบัติตัว

หลีกเลี่ยงการเดินทาง ปยังพื้นที่ๆมีการระบาดของโรค

สังเกตอาการ หากมีใข้ ไอ หายใจเหนื่อยหอบ ให้ไปพบแพทย์ที่โรงพยาบาลทันที

พร้อมทั้งแจ้งประวัติการเดินทางไปยังพื้นที่ที่มีการระบาดของโรค ภายใน14วัน

หลีกเลี่ยงสถานที่แออัด

ไม่ใช้ของใช้ส่วนตัวร่วมกับผู้อื่น (เช่น ผ้าเช็ด  หน้า   แก้วน้ำ    ผ้าเช็ดตัว)

รักษาร่างกายให้อบอุ่น

นอนหลับพักผ่อนให้เพียงพอ

สวมใส่หน้ากากอนามัย

ไม่สัมผัสหรืออยู่ใกล้ชิดกับสัตว์โดยเฉพาะที่ป่วยหรือตาย

เมื่อไอหรือจามให้ใช้กระดาษทิชชู่หรือแขนเสื้อป้องกันการกระเด็นของน้ำลายและเสมหะ

หมั่นล้างมือด้วยสบู่และให้น้ำไหลผ่านอย่างน้อย 20 วินาที หรือใช้ แอล กอ ฮอล์ เจลล้างมือ

ไม่นำมือมาสัมผัสตา จมูก ปาก โดยไม่จำเป็น
  `;
  let covidRule = `
การปฏิบัติตัวก่อนฉีดวัคซีน

1. หากมีโรคประจำตัวเรื้อรัง แพ้ยาหรือวัคซีน ต้องแจ้งแพทย์ก่อน\n

2. ไม่รับประทานยาแก้ไข้หรือแก้ปวดก่อนฉีดวัคซีน

3. แจ้งยาที่รับประทานอยู่ให้แพทย์ทราบ

การปฏิบัติตัวหลังฉีดวัคซีน

1. สังเกตอาการข้างเคียง 30 นาที ก่อนกลับบ้าน

2. เมื่อกลับถึงบ้านหากมีอาการข้างเคียงเล็กน้อย เช่น มีผื่น มีไข้ต่ำ ๆ หลังได้รับวัคซีนครึ่งชั่วโมงถึง 2 ชั่วโมง อาการจะค่อย ๆ ลดลง แต่ถ้ามีไข้สูงมาก ให้รีบไปพบแพทย์ หรือโทร 1669

3. หลังฉีดวัคซีน 3 วัน โอกาสแพ้และผลข้างเคียงจากวัคซีนจะน้อยมาก ควรสังเกตอาการให้ครบ 30 วัน`;

  let covidWhenShouldCheck = `
เมื่อไรที่เราควรรับการตรวจหาเชื้อ

หากเป็นไปได้ทุกคนที่มีอาการ หรือบุคคลที่ไม่มีอาการแต่เป็นบุคคลที่มีประวัติสัมผัสใกล้ชิดกับผู้ติดเชื้อโควิท 19 ควรได้รับการตรวจหาเชื้อ โดยปฏิบัติตามคำแนะนำของหน่วยงานสาธารณสุขในพื้นที่ของท่าน

ในขณะที่คุณรอผลการตรวจหาเชื้อ คุณควรแยกกักจากผู้อื่น และรักษามาตรการการป้องกันโรคอย่างเคร่งครัด

ในบางพื้นที่ที่การตรวจอาจมีข้อจำกัด การตรวจหาเชื้อควรทำกับกลุ่มบุคคลที่มีความเสี่ยงสูง เช่น บุคลากรด้านสาธารณสุข บุคคลที่มีความเสี่ยงที่จะเจ็บป่วยรุนแรง เช่น ผู้สูงอายุ รวมถึงบุคคลที่อาศัยอยู่ในบ้านพักผู้สูงอายุ
`;
  let value = 1;
  console.log(png);
  let src = png.png1;
  console.log(src);
  let textslide = [
    text1,
    text2,
    text3,
    text4,
    text5,
    text6,
    text7,
    text8,
    text9,
  ];
  let selected = 0;
  let change = false;
</script>

{#each Object.entries(png) as [key, value], i}
  <ion-button on:click={() => (src = value)}>
    Slide:{i + 1}
  </ion-button>
  <ion-button on:click|preventDefault={() => readOutLoud(textslide[i])}>
    <ion-icon name="play-outline" />
  </ion-button>
{/each}
<ion-card class="transition-all" transition:fly={{ y: 200, duration: 2000 }}>
  <img {src} alt="" class="transition-all" />
</ion-card>

<!-- markup (zero or more items) goes here -->
<style>
  /* your styles go here */
</style>
